; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-5)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	)
(:init
	(at plane1 city4)
	(= (capacity plane1) 7283)
	(= (fuel plane1) 1937)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 9)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 3)
	(at plane2 city2)
	(= (capacity plane2) 10781)
	(= (fuel plane2) 3533)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 8)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 2)
	(at plane3 city2)
	(= (capacity plane3) 10008)
	(= (fuel plane3) 687)
	(= (slow-burn plane3) 4)
	(= (fast-burn plane3) 12)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 6)
	(at person1 city7)
	(at person2 city1)
	(at person3 city0)
	(at person4 city2)
	(at person5 city6)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 835)
	(= (distance city0 city2) 955)
	(= (distance city0 city3) 691)
	(= (distance city0 city4) 798)
	(= (distance city0 city5) 633)
	(= (distance city0 city6) 511)
	(= (distance city0 city7) 884)
	(= (distance city0 city8) 780)
	(= (distance city1 city0) 835)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 743)
	(= (distance city1 city3) 715)
	(= (distance city1 city4) 923)
	(= (distance city1 city5) 796)
	(= (distance city1 city6) 953)
	(= (distance city1 city7) 786)
	(= (distance city1 city8) 801)
	(= (distance city2 city0) 955)
	(= (distance city2 city1) 743)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 894)
	(= (distance city2 city4) 693)
	(= (distance city2 city5) 636)
	(= (distance city2 city6) 678)
	(= (distance city2 city7) 533)
	(= (distance city2 city8) 696)
	(= (distance city3 city0) 691)
	(= (distance city3 city1) 715)
	(= (distance city3 city2) 894)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 948)
	(= (distance city3 city5) 866)
	(= (distance city3 city6) 563)
	(= (distance city3 city7) 661)
	(= (distance city3 city8) 527)
	(= (distance city4 city0) 798)
	(= (distance city4 city1) 923)
	(= (distance city4 city2) 693)
	(= (distance city4 city3) 948)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 997)
	(= (distance city4 city6) 704)
	(= (distance city4 city7) 589)
	(= (distance city4 city8) 871)
	(= (distance city5 city0) 633)
	(= (distance city5 city1) 796)
	(= (distance city5 city2) 636)
	(= (distance city5 city3) 866)
	(= (distance city5 city4) 997)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 564)
	(= (distance city5 city7) 924)
	(= (distance city5 city8) 826)
	(= (distance city6 city0) 511)
	(= (distance city6 city1) 953)
	(= (distance city6 city2) 678)
	(= (distance city6 city3) 563)
	(= (distance city6 city4) 704)
	(= (distance city6 city5) 564)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 755)
	(= (distance city6 city8) 722)
	(= (distance city7 city0) 884)
	(= (distance city7 city1) 786)
	(= (distance city7 city2) 533)
	(= (distance city7 city3) 661)
	(= (distance city7 city4) 589)
	(= (distance city7 city5) 924)
	(= (distance city7 city6) 755)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 959)
	(= (distance city8 city0) 780)
	(= (distance city8 city1) 801)
	(= (distance city8 city2) 696)
	(= (distance city8 city3) 527)
	(= (distance city8 city4) 871)
	(= (distance city8 city5) 826)
	(= (distance city8 city6) 722)
	(= (distance city8 city7) 959)
	(= (distance city8 city8) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane3 city2)
	(at person1 city4)
	(at person3 city3)
	(at person4 city7)
	(at person5 city6)
	))

(:metric minimize (+ (* 4 (total-time))  (* 4 (total-fuel-used))))
)

; plan
1. (board person4 plane2 city2)
   deleted: (at person4 city2)
   added: (in person4 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 2 of 5
2. (fly plane2 city2 city7)
   deleted: (at plane2 city2)
   added: (at plane2 city7)
   changed: (total-fuel-used) from 0 to 2132, (fuel plane2) from 3533 to 1401
   goals met: 2 of 5
3. (debark person4 plane2 city7)
   deleted: (in person4 plane2)
   added: (at person4 city7)
   changed: (onboard plane2) from 1 to 0
   goals met: 3 of 5
4. (refuel plane1 city4)
   changed: (fuel plane1) from 1937 to 7283
   goals met: 3 of 5
5. (fly plane1 city4 city7)
   deleted: (at plane1 city4)
   added: (at plane1 city7)
   changed: (total-fuel-used) from 2132 to 3899, (fuel plane1) from 7283 to 5516
   goals met: 3 of 5
6. (board person1 plane1 city7)
   deleted: (at person1 city7)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 5
7. (fly plane1 city7 city4)
   deleted: (at plane1 city7)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 3899 to 5666, (fuel plane1) from 5516 to 3749
   goals met: 3 of 5
8. (debark person1 plane1 city4)
   deleted: (in person1 plane1)
   added: (at person1 city4)
   changed: (onboard plane1) from 1 to 0
   goals met: 4 of 5
9. (fly plane1 city4 city3)
   deleted: (at plane1 city4)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 5666 to 8510, (fuel plane1) from 3749 to 905
   goals met: 4 of 5
10. (refuel plane1 city3)
   changed: (fuel plane1) from 905 to 7283
   goals met: 4 of 5
11. (fly plane1 city3 city0)
   deleted: (at plane1 city3)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 8510 to 10583, (fuel plane1) from 7283 to 5210
   goals met: 4 of 5
12. (board person3 plane1 city0)
   deleted: (at person3 city0)
   added: (in person3 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 4 of 5
13. (fly plane1 city0 city3)
   deleted: (at plane1 city0)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 10583 to 12656, (fuel plane1) from 5210 to 3137
   goals met: 4 of 5
14. (debark person3 plane1 city3)
   deleted: (in person3 plane1)
   added: (at person3 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 5 of 5
